Revit 2024 API
UIMacroManager Methods
The UIMacroManager type exposes the following members.
Methods
Name | Description
AddModule
 Adds a MacroModule to the application or document.
Dispose
EditMacro
 Edits the macro in sharp develop.
EditModule
 Edits the macro in sharp develop.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMacroManager(UIApplication)
 Gets the UI Macro manager from the UI application.
GetMacroManager(UIDocument)
 Gets the UI Macro manager from the UI document.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetUIDocumentMacroSecurityOptions
 Gets the UI document macro security options.
RemoveModule
 Removes a MacroModule from the application or document.
SetUIDocumentMacroSecurityOptions
 Sets the UI document macro security options.
StepInto
 Step into the macro in sharp develop.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace